programming/java/深入理解java虚拟机.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-06-11 Sun 11:50 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Note on "深入理解Java虚拟机"</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Zhao WenBin">
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Note on "深入理解Java虚拟机"</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org08fc0fd">概述</a></li>
<li><a href="#org6e51140">Java 虚拟机</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org08fc0fd" class="outline-2">
<h2 id="org08fc0fd">概述</h2>
<div class="outline-text-2" id="text-org08fc0fd">
</div><div id="outline-container-org2950620" class="outline-3">
<h3 id="org2950620">Java 技术体系</h3>
<div class="outline-text-3" id="text-org2950620">
<ul class="org-ul">
<li>Java 语言</li>
<li>JVM 虚拟机</li>
<li>Class 格式</li>
<li>API 类库</li>
<li>第三方类库</li>
</ul>
</div>
</div>





<div id="outline-container-org37a2179" class="outline-3">
<h3 id="org37a2179">Java 的优势</h3>
<div class="outline-text-3" id="text-org37a2179">
<ul class="org-ul">
<li>结构严谨、面向对象的编程语言</li>
<li>提供内存管理，避免内存泄露与指针越界</li>
<li>在虚拟机层面隐藏了底层技术的复杂性以及机器与操作系统的差异性</li>
<li>热点代码检测和运行时编译优化</li>
<li>完善的应用程序接口</li>
</ul>
</div>
</div>

<div id="outline-container-org49f4e81" class="outline-3">
<h3 id="org49f4e81">Java 平台的分类</h3>
<div class="outline-text-3" id="text-org49f4e81">
</div><div id="outline-container-org6b2952f" class="outline-4">
<h4 id="org6b2952f">按业务分类</h4>
<div class="outline-text-4" id="text-org6b2952f">
<dl class="org-dl">
<dt>Java Card</dt><dd>小内存设备平台</dd>
<dt>JavaME</dt><dd>终端</dd>
<dt>JavaSE</dt><dd>标准</dd>
<dt>JavaEE</dt><dd>企业</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org0b6ec0d" class="outline-3">
<h3 id="org0b6ec0d">需要关注的技术</h3>
<div class="outline-text-3" id="text-org0b6ec0d">
<ul class="org-ul">
<li>反射（reflection）</li>
<li>自动装箱</li>
<li>泛型</li>
<li>动态注解</li>
<li>枚举</li>
<li>foreach 循环</li>
<li><code>java.util.concurrent</code></li>
<li>lambda 表达式</li>
</ul>
</div>
</div>
</div>













<div id="outline-container-org6e51140" class="outline-2">
<h2 id="org6e51140">Java 虚拟机</h2>
<div class="outline-text-2" id="text-org6e51140">
</div><div id="outline-container-orgccb1e5d" class="outline-3">
<h3 id="orgccb1e5d">概述</h3>
<div class="outline-text-3" id="text-orgccb1e5d">
<ul class="org-ul">
<li>不止 Sun Java 1.0 中的 Sun Classic VM</li>
<li>Sun JDK 和 OpenJDK 中的 HotSpot 虚拟机</li>
<li>BEA 的 JRockit 和 IBM J9</li>
<li>其它</li>
</ul>
</div>
</div>

<div id="outline-container-org274a14b" class="outline-3">
<h3 id="org274a14b">虚拟机</h3>
<div class="outline-text-3" id="text-org274a14b">
</div><div id="outline-container-orged0699a" class="outline-4">
<h4 id="orged0699a">Sun Classic VM</h4>
<div class="outline-text-4" id="text-orged0699a">
<ul class="org-ul">
<li>Class VM 是第一款商用 Java 虚拟机</li>
<li>只能以纯解释器方式来执行</li>
<li>不能与编译器混合</li>
<li>在 JDK1.3 时被 HotSpot 替换默认位置，1.4 中退出</li>
</ul>
</div>
</div>

<div id="outline-container-orgab986c7" class="outline-4">
<h4 id="orgab986c7">Sun Extract VM</h4>
<div class="outline-text-4" id="text-orgab986c7">
<ul class="org-ul">
<li>JDK1.2 中加入 Solaris Extract VM</li>
<li>两级即时编译器</li>
<li>编译器与解释器混合工作模式</li>
</ul>
</div>
</div>

<div id="outline-container-org5d322b5" class="outline-4">
<h4 id="org5d322b5">Sun HotSpot VM</h4>
<div class="outline-text-4" id="text-org5d322b5">
<ul class="org-ul">
<li>是 Sun JDK 和 OpenJDK 所带的虚拟机</li>
<li>既是 Sun 公司开发 的，也不是原生为 Java 作的</li>
<li>热点代码探测技术：通过执行计数器找出最有编译价值的代码，然后通知 JIT 编译器以方法为单位进行编译</li>
<li>通过编译器与解释器恰当地协同工作，可以在最优化的程序响应时间与最佳性能中取得平衡，而且无需等待本地代码输出才能执行程序，即时编译时间压力也相对减少</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdce459b" class="outline-3">
<h3 id="orgdce459b">Java 发展趋势</h3>
<div class="outline-text-3" id="text-orgdce459b">
<ol class="org-ol">
<li>模块化</li>
<li>混合语言</li>
<li>多核并行</li>
<li>进一步丰富语法</li>
<li>64 位虚拟机</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhao WenBin</p>
<p class="date">Created: 2017-06-11 Sun 11:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
